{
	"url"				: "emotionaldesign",
	"type"				: "individual",
	"title" 			: "Emotional Design",
	"abstract" 			: "Creating relationships with objects.",
	"logo"				: "assets/logos/emotionaldesignlogo.svg",
	"photo"				: "assets/photos/emotionaldesignphoto.jpg",
	"skills"			: ["design"],
	"video"				: null,
	"githubLink"		: null,
	"externalLink"		: null,
	"fileLink" 			: null,
	"blogContent"		: "<div class='container blog'> <p>Over the past two weeks, I've been trying to understand Emotional Design. This article summarises my thoughts and is the first post within the series \"<a href='#project/ucdexploration' target='_blank'>Emotional Design / Usability / Business Design</a>\".</p> <p>Emotional design deals with the emotions created when interacting with objects (<i>whether they be physical and/or virtual</i>) and the role design plays in this process. To better understand how this works, we need to figure out how people behave. </p> <p>Don Norman, a cognitive scientist, engineer & usability expert suggests the following cognitive model:</p> <br/> <div class='embed-responsive embed-responsive-16by9'><iframe class='embed-responsive-item' src='https://www.youtube.com/embed/CPp80CfM2HQ?start=73&amp;end=214&amp;rel=0&amp;showinfo=0'></iframe></div> <br/> <p>According to this, when interacting with objects, we tend to act on three distinct levels: the <strong>Visceral</strong>, the <strong>Behavioural</strong> & the <strong>Reflective</strong>. The first has to do with aesthetics & our instinctive, lizard-brain reaction to an object. Whether it's beautiful, if its aesthetically pleasing, etc. Like it or not, we are hard-wired to react positively to certain stimuli and negatively to others (e.g. <i>sour tastes, dissonant sounds, etc</i>).</p> <p>The behavioural level has to do with how well we can manipulate an object. If we command complete control over it then we feel satisfied, skillfull, empowered. If not, we are left frustrated. How many times have to tried to use a piece of sofware only to feel like you wanted to SMASH your computer against the wall?</p> <p>The reflective level has to do with what the object symbolises, what it represents and how it relates to our goals. And here is where things start to get tricky. We thus enter the world of psychology.</p> <h2>Three Reflective Selves</h2> <p>Between 1976 & 1980, a group of psychologists performed a study to discover the most cherished household objects for American families. They published their results in a book entitled \"<a href='http://www.cambridge.org/ca/academic/subjects/psychology/social-psychology/meaning-things-domestic-symbols-and-self' target='_blank'>The meaning of things: Domestic symbols & the self</a>\". As expected, the meaning of things is dependant on our phyche, on how we develop and what goals we set. To tackle this issue, they suggest three levels for the conscious/reflecive self: the <strong>Personal</strong>, the <strong>Social</strong> & the <strong>Cosmic</strong>.</p> <p>The Personal self has to do with our relation to the physical world, as individuals. We strive to understand what we are physically capable of, which emotions we can experience & control, to explore our limits. Objects are crucial to this discovery. For instance, an infant is fascinated by a ball because through it, it discovers what effects its actions have on the world. The ball can bounce, it can move, it can stop, it can produce sounds, it can seem smaller when it's far away. Through this, the child can define its Personal self in relation to the physical environment and therefore develop. </p> <p>If the Personal self serves to answer the question \"<i>Who am I?</i>\", the Social self answers \"<i>Who are you and me?</i>\". The Social self is part of one's psychic activity in communion with the goals of friends, coworkers, the craft of work itself and the various other institutions that make up one's world. Let's consider photographs. We cherish them because they provide symbolic links to our family, to our friends. They objectify our relationships with other individuals and serve as a reminder to who we are in relation to others. It's interesting to note that although the Personal self perishes after death, the Social self continues to exist, often through objects (<i>photographs, furniture, etc.</i>) which act as symbols for other people to reminisce. A final note on the Social self: objects may also be used to demonstrate superiority. An expensive car or a Rolex watch are status symbols through which we attempt to define ourselves as \"better\" than others.</p> <p>But we are neither simply individual agents nor just social beings with relations to our immediate social environment. We often find ourselves asking deeper questions in an attempt to discover our relation to society, to the world & to the universe at large. The Cosmic self has to do with the question \"<i>What & why is it?</i>\" Our answers may come in various forms, whether it be through religion or political ideals. Once again, objects here play a crucial role. The crucifix, the constitution & pictures of political figures are objects which embody our quest to define our position in relation to the world. </p> <h2>The role of design</h2> <p>It is therefore possible to represent the way we think & act through the following pyramid:</p> </div> <br/> <img src='assets/photos/emotionaldesignpyramid.png' width='100%' /> <div class='container blog'> <br/> <p>This implies that when interacting with an object, our emotions are shaped by its aesthetic appeal, its usability and the meaning we attribute to it (<i>depending on the type of self(s) we associate it with</i>).</p> <p>Design then becomes a rather complicated affair. The designer has to first understand which \"<i>self(s)</i>\" the object is helping develop, on the reflective level. Only by understanding the <i>self(s)</i> van the designer create an object able to acquire meaning and satisfy the required goal. At the same time, the designer must create something appealing on the visceral level and \"usable\" on the behavioural level. </p> <p>To further illustrate this point, let's assume that the designer has to create a hobbyist power tool. The self for which this object will probably acquire meaning is the Personal. The reason is that a power tool is an extension of oneself (when performing certain actions). It enhances & enables the user's interactions with matter and redefines his/her relation to the physical world. The power tool may acquire meaning, representing the owner's control (even triumph!) over matter. To achieve this however, the power tool must be reliable, precise, safe and obey exactly its master's commands. This has important repercussions at the the behavioural level. At the same time, it must convey this image of power and control from the first glance. This therefore defines a number of the object's aspects on the visceral level. </p> <p>Having this model in mind provides designers with a certain structure to their thought process & work. This helps make sure that what they are creating is coherent, that no major conflicts exist. It is not a magic formula: it is an aid to keep in mind.</p> <br/> <h2>References</h2> <p> <ul> <li>Don Norman's <a href='http://www.ted.com/talks/don_norman_on_design_and_emotion?language=en' target='_blank'>TED talk</a> on Emotional Design</li> <li><a href='https://en.wikipedia.org/wiki/Emotional_Design' target='_blank'>Emotional Design</a> by Don Norman</li> <li><a href='https://en.wikipedia.org/wiki/The_Design_of_Everyday_Things' target='_blank'>The design of everyday things</a> by Don Norman</li> <li><a href='http://www.cambridge.org/ca/academic/subjects/psychology/social-psychology/meaning-things-domestic-symbols-and-self' target='_blank'>The meaning of things: Domestic symbols & the self</a> by Mihaly Csikszent & Eugene Halton</li> </ul> </p> </div>",
	"createdDate"		: "2015-05-15T18:25:43.511Z"
}