{
	"url"				: "semanticweb",
	"type"				: "individual",
	"title" 			: "Semantic Web",
	"abstract" 			: "Exploring the Semantic Web, Linked Data & JSON-LD",
	"logo"				: "assets/logos/semanticweblogo.svg",
	"photo"				: "assets/photos/semanticwebphoto.jpg",
	"skills"			: ["coding"],
	"video"				: null,
	"githubLink"		: "https://github.com/reelyactive/json-silo/tree/encryption",
	"externalLink"		: "http://json-ld.org/playground/index.html",
	"fileLink" 			: "http://www.manning.com/dwood/",
	"blogContent"		: "<div class='container blog'> <p><i>I recently implemented a system heavily based on the use of JSON-LD. I was first thrilled to learn about this new technology and the seemingly endless possibilities it offered. When I started coding however, the rainbow disappeared.</i></p> <p><i>I am not an Semantic Web Expert. I am simply a web developer attempting to use this cool, new technology.</i></p> <h2>The Semantic Web</h2> <p>If we ever want to ask the Internet a question and get back an intelligent response (and not just a list of websites) we need to make machines understand our questions <strong>as well as</strong> the information available on the Internet. The Semantic Web deals with the latter question.</p> <p>Let's consider the following webpage:</p> </div> <br/> <img src='assets/photos/semanticwebexample.jpg' width='100%'/> <div class='container blog'> <p>We see William and Kate getting married; we know that they are members of the royal family, we know that this is joyfull event & that it took place in April of 2011. But a machine simply sees text, text, hyperlinks & a picture. So how can we ask it to get information if it doesn't understand what's there?</p> <p>There are multiple ways to tackle this problem. The Semantic Web takes the following approach: it gives machines & humans a common language. And it forces them to speak it. So that when writing that Kate married William, we must embed somewhere in the page the sentence \"<i>Kate wife of William</i>\". If this sentence does not exist, the machine will never know of their marriage. This sentence need not be seen by humans but it must certainly be written by someone at some point & included in the page. And we must all agree to which words to use & what the syntax of the sentences should be.</p> <h2>Linked Data</h2> <p>Imagine now that I want the machine to know who Kate is. I could embed all the information about Kate in the same page. But a simpler approach would be to re-use her Wikipedia page! Now, by replacing the name \"Kate\" with that link I can fully describe Kate. I can even go so far as to describe what \"marriage\" is, therefore allowing the machine to reach a greater understanding of what the royal wedding is! By describing entities through uniquely identifiable links, we provide machines with a greater understanding of the world. This is what Linked Data is all about.</p> <h2>JSON-LD</h2> <p>JSON-LD is one of the possible implementations of Linked Data. Because a lot of web developers use JSON, and many API's return JSON, it is nice to have a way to provide linked data in this format.</p> <h2>Trough of Disillusionment</h2> <p>All of this sounds great, doesn't it? I thought so too, in the beginning. Then I started to play around with it. And the rainbow disappeared.</p> <p>My objections are two-fold. The first is a philosophical one dealing with the creation of a new \"language\". The second one has to do with the way we can find and describe entities (<i>mostly places, objects & people</i>).</p> <p>The basic assumption of the Semantic Web is that we can create a common language between humans and machines. But a language is a way to describe the world. And the way to describe it depends on the viewer, it is subjective. This is the reason so many different languages exist, the reason we use them in so many different ways and why we sometimes have difficulty understanding each other. In my opinion, defining some sort of super-language is not possible, it's not human. Unfortunately, I witnessed a lot of people attempting to do just that in the Semantic Web community.</p> <p>We can however say that multiple languages can & must exist. JSON-LD for instance takes this approach by simply defining a syntax. Anyone can then create his/her own vocabulary and define its terms in any way they wish. In theory, this is great! I found however that there were so many different vocabularies available; it was incredibly difficult to choose one. None of them fitted 100% to my needs & I was even tempted to create my own one, adding my own drops to the sea of words. I proceeded by attempting to combine different vocabularies; a daunting task mostly due to their conflicting terms. And then I realised that the key for this thing to work is to allow people to combine vocabularies. We must find a way to stitch together different vocabularies, effortlessly. <strong>The Semantic Web and Linked Data must become the glue holding different vocabularies together</strong>. If not, then this great idea will never work.</p> <p>The second problem I encountered had to do with finding entities. Say I want to state the fact that \"<i>Jane owns an iPhone</i>\". I have no problem writing down a couple of information about \"<i>Jane</i>\". But what about the \"<i>iPhone</i>\"? I most certainly don't want to write all that information all by myself...! Databases do exist for that purpose but they contain different parts and pieces of the information I require. Some of them are really badly maintained and surprisingly unfriendly to query.</p> <p>Suppose I want to combine a couple of them; how do I go about doing it? How do I deal with conflicting information? What happens if one disappears at some point? The purpose of Linked Data is defied if all the links are created by myself!</p> <h2>Slope Of Enlightenment</h2> <p>Philosophically, I think that the Semantic Web is a very powerful idea. I am a firm believer. I really think it provides a common ground for machines to understand the information present in the Internet.</p> <p>Speaking however as a web developer, this technology is not mature enough. I had a hard time using it and I'm not entirely convinced of the benefits I gained. In my opinion, we need to develop mechanisms allowing the combination of existing vocabularies and databases. If not, then very few developers will use it.</p> <br/> __ <p><i>Note: My project can be found on <a href='https://github.com/reelyactive/json-silo/tree/encryption' target='_blank'>Github</a></i></p> </div>",
	"createdDate"		: "2015-01-15T18:25:43.511Z"
}