{
	"url"				: "ucdexploration",
	"type"				: "individual",
	"title" 			: "UCD Exploration",
	"abstract" 			: "Exploring User Centered Design",
	"logo"				: "assets/logos/ucdexplorationlogo.svg",
	"photo"				: "assets/photos/ucdexplorationphoto.jpg",
	"skills"			: ["design"],
	"video"				: "",
	"githubLink"		: null,
	"externalLink"		: null,
	"fileLink" 			: null,
	"blogContent"		: "<div class='container blog'> <p>The previous week, I decided to delve a bit deeper in the exploration of User Centered Design (UCD).</p> <p>Although I have been applying its principles to my projects, I felt that a more solid theoretical foundation was necessary.</p> <p>After listening to talks, watching videos & reading articles, I identified the three movements/currents that interest me most. These are:</p> <ul> <li><strong>Usability Design</strong></li> <li><strong>Emotional Design</strong></li> <li><strong>\"Business\" Design</strong></li> </ul> <p>Over the course of the next few weeks, I will be exploring each one in greater detail. What follows, is very broad summary of my initial thoughts.</p> </div> <br/> <img src='assets/photos/ucdexplorationnielsen.jpg' width='100%'/> <div class='container blog'> <h2>Usability Design & Jakob Nielsen</h2> <p>Jakob focuses on the usability of a given product (mostly for tech). He follows a very analytic/scientific testing method for determining whether a user successfully manages to use the product as intended. His main focus is on efficiency which leads him often to overlook aspects such as typography, readability & visual cues (which clearly contribute to the overall user experience). He is a strange creature, half-designer, half-engineer, with the latter one clearly dominating.</p> </div> <br/> <img src='assets/photos/ucdexplorationnorman.jpg' width='100%'/> <div class='container blog'> <h2>Emotional Design & Don Norman</h2> <p>Don is considered the father of User Centered Design. I believe he started off life being very similar to Jakob (btw they actually own a <a href='http://www.nngroup.com/' target='_blank'>company</a> together!) but somewhere on the way, he decided to change. Today, he places a strong emphasis on the emotions created by a given product, from the moment attained to its disposal. Surprisingly, he makes the argument that a completely \"useless\" object, such as the <a href='http://cecirealwmilk.blogspot.ca/2012/01/teapot-for-masochists.html' target='_blank'>Teapot for Masochists</a>, is good design!</p> <p>The detailed article can be found here: <a href='#project/emotionaldesign' target='_blank'>Emotional Design</a></p> </div> <br/> <img src='assets/photos/ucdexplorationwhiteman.jpg' width='100%'/> <div class='container blog'> <h2>\"Business\" Design & Patrick Whitney</h2> <p>The first two movements dealt with the relationship between a given product & its end-user. Patrick is interested in the question of how insights about user experience can influence business strategy. In other words, how insights gathered from Jakob & Don's analyses can influence the decision-making of an organisation</p> <p>I consider all three approaches to be complementary. In the real world, one cannot exist without the other. Over the next couple of weeks I will be exploring each one in greater detail. I think I'll start off with Don; I'll keep you posted on how it goes! :)</p> </div>",
	"createdDate"		: "2015-04-15T18:25:43.511Z"
}