{
	"url"				: "agrockathon",
	"type"				: "group",
	"title" 			: "Agrockathon",
	"abstract" 			: "Organising the 1st Greek Agriculture Hackathon in Crete, Greece.",
	"logo"				: "assets/logos/agrockathonlogo.svg",
	"photo"				: "assets/photos/agrockathonintro.jpg",
	"skills"			: ["coding", "design"],
	"video"				: "https://www.youtube.com/embed/6CC_B6ma4SA?rel=0&amp;showinfo=0",
	"githubLink"		: null,
	"externalLink"		: "http://agrockathon.eu/",
	"fileLink" 			: "https://drive.google.com/drive/folders/0B-cpmUqy2OFTRFdIbnVYWjlmdzA",
	"createdDate"		: "7 Jun, 2015 23:15:00",
	"blogContent"		: "<div class='container blog'><p>On the 5th, 6th & 7th of July, I co-organized an agriculture hackathon (<a href='http://www.agrockathon.eu/'>Agrochathon</a>) in Crete, Greece.</p><p>Thirty technologists, farmers, designers & handymen came from around Greece to prototype technological solutions to pressing agricultural problems.</p></div><div class='container'><div class='embed-responsive embed-responsive-16by9'><iframe class='embed-responsive-item' src='https://www.youtube.com/embed/6CC_B6ma4SA?rel=0&amp;showinfo=0'></iframe></div></div><br/><div class='container blog'><p>Amongst the projects created, was an automated greenhouse air ventilation system, an intelligent watering system & a web-platform to inform farmers of current affairs.</p><p>But I don’t want to focus on the results. I wish to talk about the process leading to the Agrockathon and what I learnt through it.</p><p>Besides learning a ton of things around agriculture & how IoT can shape its future, the Agrockathon was a revelation as to how Greeks collaborate. It gave a fresh perspective explaining the country’s current woes.</p><p>The hackathon provided a condensed, accelerated view of the Greek work culture. People from different backgrounds worked intensely in a limited time-period to create something of value together. It was the perfect way to observe how Greeks collaborate, how they think and how they create.</p></div><div class='jumbotron full-width-image full-height-image' style=\"background-image:url('assets/photos/agrockathonproject.jpg')\"></div><div class='container blog'><h2>STEREOTYPE 1: GREEKS CAN'T COLLABORATE</h2><p><strong>TRUE.</strong></p><p>People, working in teams of 6-8, seemed at first to be working together. But a closer inspection deemed that they were not really listening to one another. Everyone was speaking his/her mind without paying attention to the other side. Discussions seemed fragmented. When consensus was reached, it was usually out of indifference. It was impossible to divide tasks and accomplish a goal together.</p><p>I was surprised to be approached at the end by all three teams complaining that we hadn’t assigned a “project manager” to their them. In other words, they wanted me, an outsider, to assign them a “boss”! They couldn’t even decide amongst themselves on who their team leader should be.</p><p>A true lack of collaboration.</p><p>If this is true on this small scale, imagine how it must be within organizations of thousands. The only way to avoid complete a breakdown by having a leader which has concentrated power and micro-manages those below him/her (<i>this is actually the way the municipality of Heraklion is run - but this is a story for another time!</i>)</p><p>The reasons behind this behavior are probably multifaceted and complex. But I guess that a major one is education. From primary school to university, Greeks are never taught how to work in teams. We seldom perform group projects. We’ve been working alone for the first 23 years and it’s a bit late to start working with others successfully after that.</p></div><div class='jumbotron full-width-image full-height-image' style=\"background-image:url('assets/photos/agrockathonteam.jpg')\"></div><div class='container blog'><h2>STEREOTYPE 2: GREEKS ARE CONSERVATIVE</h2><p><strong>TRUE.</strong></p><p>Teams seemed afraid to explore new ideas. They refused to move into unchartered territory. They preferred the comfort of what they knew (<i>or, for that matter, what they thought they knew</i>).</p><p>A short incident exemplifying this: A team was working on a social web platform informing farmers of current agricultural affairs. They most surely recognized the success of Facebook and deemed it could be repeated. I remained skeptical, mostly because I know that farmers are not very tech-savvy. Hell, even the team's farmer didn’t use a computer!</p><p>I insisted that they explore other ways to interact with the user. How about modifying widely used media such as television or the radio? What about experimenting with simple, intelligent objects? And if farmers do use phones, why not adapt to their current usage?</p><p>My suggestions fell onto deaf ears. The participants used Facebook. They new Facebook. They recognized its success. They wanted to repeat it. Exploring new media and different interfaces (<i>physical or virtual</i>) was too “experimental”.</p><p>What did they have to lose? Three days of their lives? A long weekend? A small price to pay if you’re trying to discover something new.</p><p>In all three teams I saw this fear. A strong conservatism. Whether it be from designers, technologists or farmers.</p></div><div class='container blog'><h2>STEREOTYPE 3: GREEKS ARE LAZY</h2><p><strong>FALSE.</strong></p><p>People were incredibly eager to work. When we asked for something, they were (mostly :) ) happy to do it! If they disagreed with us, they expressed themselves in a polite and friendly way.</p><p>Plus, everyone stayed long hours into the night, trying to complete their prototypes and polish their presentations. They were truly motivated and eager to help the farmers within their team.</p></div><div class='jumbotron full-width-image full-height-image' style=\"background-image:url('assets/photos/agrockathonpresentation.jpg')\"></div><div class='container blog'><p>The past few years have been incredibly difficult for the Greeks. But casting economic & political arguments aside, I believe that the true reason for Greece’s woes is cultural.</p><p>If one cannot work within teams and is afraid of all things new, then one is doomed to be alone, constantly repeating the mistakes of the past.</p><p>In a post-modern world dominated by efficiency, productivity and innovation, it is very difficult to see the Greeks as champions.</p><p>So unfortunate.</p><br/>__<p><i>Disclaimer:</i></p><p><i>My conclusions are not drawn out of thin air. I have organized over 20 Hackathons & Makeathons in countries including France, the UK, Sweden, Canada and Greece. Their themes have ranged from healthcare to museology & agriculture.</i></p><p><i>I’m also aware that generalizing from a group of 30 people is not very accurate. Nonetheless, it is not completely false either. Some interesting conclusions can still be drawn. Oh! And I have lived in Greece for almost 20 years…!</i></p></div>"
}