{
	"url"				: "combatcontrol",
	"type"				: "individual",
	"title" 			: "Combat Control",
	"abstract" 			: "Creating the technology backbone for a viral video.",
	"logo"				: "assets/logos/combatcontrollogo.svg",
	"photo"				: "assets/photos/combatcontrolphoto.jpg",
	"skills"			: ["coding", "business"],
	"video"				: "https://www.youtube.com/embed/h1_D1At8g6E?rel=0&amp;showinfo=0",
	"githubLink"		: null,
	"externalLink"		: null,
	"fileLink" 			: null,
	"blogContent"		: "<div class='container blog'> <p>A couple of weeks ago I participated in the creation of a viral video. The idea was simple: create a real-life street-fighter arcade game. Random people from the audience could step up and remotely control fighters using an arcade console.</p> <p>My role was to create the underlying technology. In other words, how the fighters \"secretly\" received the commands, how their life levels were displayed on a (massive!) screen, etc. But the technical details are not the purpose of this article. True, I did learn a lot of stuff through this project. <strong>But what I realized was how far apart the tech and advertising worlds are</strong>.</p> <p>I remember coding late into the night. Sunday laser cutting in an empty room. Grabbing my 3D print and running to catch the last tube. Definitely not the ideal working conditions. Don't get me wrong, it was not the first time I had done this, but most of the other times were in university. In other words, times in which it was alright if the technology worked 50% of the time and the code was as dirty as a Thai brothel.</p> <br/> <div class='embed-responsive embed-responsive-16by9'><iframe class='embed-responsive-item' src='https://www.youtube.com/embed/h1_D1At8g6E?rel=0&amp;showinfo=0'></iframe></div> <br/> <p>But in the real world, tech projects need to work 100% of the time. This means that you need to test extensively. You need to source the right materials, write tests for your code, think & discuss about it with other people. You need to have a clear mind. This implies time. And time always implies money.</p> <p>But apparently, the advertisement world doesn't work in the same way. It's logic seems to be: \"<i>It's alright if it doesn't work all the time. As long as we get the right shots, we're good to go</i>\". Budgets & deadlines are tight as hell and they're usually not distributed meritocratically. The overall effect is that a lot of people work overtime for not a lot of money. Not a beautiful picture.</p> <p>Putting the ethical questions aside, this fact poses a real problem for the technical person. That person is used to making things that work 99.9% of the time. That person needs a clear state of mind to write code because so much depends on small details (<i>forget a semicolon & your program burns in Hell</i>). The product of your work is supposed to last, be incrementally improved and built upon. It's a completely different work philosophy. It's the yin of the advertisement world.</p> <p>I really felt strange working in such an environment. <strong>I realised that hard skills are softer than I thought</strong>! If you have some technical expertise, it doesn't mean that you can apply it everywhere. So much has to do with the way you're used to work. I think that most engineers are used to a thorough & incremental development of projects. That means that they will have a hard time getting used to a different way of working. So unless you are ok with this (<i>or an inexperienced university student!</i>), think twice about starting such a project!</p> </div>",
	"createdDate"		: "2015-03-15T18:25:43.511Z"
}