{
	"url"				: "customersupport",
	"type"				: null,
	"title" 			: "Customer & Support",
	"abstract" 			: "How to structure a customer support service?",
	"logo"				: "assets/logos/customersupport.svg",
	"photo"				: "assets/photos/customersupportintro.jpg",
	"skills"			: ["business"],
	"video"				: null,
	"githubLink"		: null,
	"externalLink"		: null,
	"fileLink" 			: null,
	"blogContent"		: "<div class='container blog'> <p> <i>Fun fact: <a href='http://help.desk.com/thank-you-millennials-report-providing-customer-service-for-todays-consumers' target='_blank'>56% of millennials</a> would recommend a company after a positive customer support experience.</i> </p> <p>I was asked to imagine the customer support service for a hardware product. A daunting task because not only does customer support define the way people view an organization but also how they are going to talk to others about it.</p> <p> Because I participated in the early stages of the project, I undertook two missions: <ul> <li>Researched what other companies were doing.</li> <li>Created low-fidelity prototypes to visualise how people would interact with the service.</li> </ul> </p> <p>But of course, customer support involves processes, hiring people, having a culture, etc. I thought that all of that could be derived from the end result (<i>what the user sees / hears / feels</i>).</p> <br/> <h2>RESEARCHING COMPANIES</h2> <p>I researched approximately 30 companies which boasted great customer support. I also took a closer look at hardware companies.</p> <p>Two findings struck me as interesting:</p> <ul> <li> <strong>Zappos</strong> chooses to forgo classic customer support metrics in favor of the '<a href='http://csi.softwareadvice.com/a-zappos-lesson-in-customer-service-metrics-1101029/' target='_blank'>Happiness Experience Form</a>'. It’s goal is to make sure that its representatives are engaging with customers rather than minimize costs (<i>e.g. call time, etc</i>). </li> <br/> <li> Some tech companies (<i>e.g. <a href='http://help.getpebble.com/' target='_blank'>Pebble</a></i>) have resorted to community-based customer support formats. Imagine <a href='http://stackoverflow.com/' target='_blank'>Stack Overflow</a> but for a product. Because so many problems can arise with hardware, the community provides a format allowing low cost, high engagement & large coverage (<i>the problem is that information is at times conflicting and response times aren’t great</i>). </li> </ul> <p>If you are interested in finding out more, <a href='https://docs.google.com/spreadsheets/d/1miyMlyO1BCh46LZsCteFIIBh5p4BgcxTTjf97sTn7NA/edit' target='_blank'>here is a sample of the data.</a></p> <h2>LOW FIDELITY PROTOTYPING</h2> <p>After researching the companies, I had to pass to action. I thought about how the user could interact with this service. What will he/she see? How will he/she interact with the company? What will he/she feel?</p> <p>The best way to wrap my head around it was to create low-fidelity prototypes. This included, a website, a mobile application, an FAQ and chat simulations.</p> <p>By taking this user-centric approach & by figuring out the end result, we can then set out to define the processes, the tools, the people to hire, etc.</p> <h3>MOBILE</h3> </div> <br/> <img src='assets/photos/iPhoneMockup.gif' alt='Mobile low fidelity prototype' width='100%' /> <div class='container blog'> <p>I thought that the basic use of a smartphone is to search, call & text. So I tried to structure the support in this fashion</p> <ul> <li><strong>Search</strong>: Help articles with comment system (<i>for community support</i>)</li> <li><strong>Chat</strong>: Use a standard text messaging interface. We’re used to them and they’ve been around for decades.</li> <li><strong>Call</strong>: Use a standard phone call interface. We’re used to them and they’ve been around for decades.</li> </ul> <p>By reducing a phone to its core functions & having the interface reflect that, I thought that it would be much easier for the user to find answers to his questions.</p> <h3>WEBSITE</h3> </div> <br/> <img src='assets/photos/websiteMockup.gif' alt='Website low fidelity prototype' width='100%' /> <div class='container blog'> <p>After giving it some thought, I concluded that people will look at the website's customer support portal to judge whether this product is worth purchasing. For real problem troubleshooting & support, they will turn to the mobile application, simply because they are used to interacting with the product in this manner. The app will inevitably become their point of reference for everything.</p> <p>On the website, the user will probably be in one of three situations: </p> <ul> <li><i>I want to buy the product</i></li> <li><i>I'm waiting for the product to get delivered</i></li> <li><i>I own the product</i></li> </ul> <p>For each one, an entire set of questions can be derived. If the user can’t find what they’re looking for, help should be a click away in the form of texting, phone calling, live chatting & emailing.</p> <h3>CUSTOMER SUPPORT REPRESENTATIVES</h3> </div> <br/> <img src='assets/photos/personnachats.jpg' alt='Chat low fidelity prototype' width='100%' /> <div class='container blog'> <p>Customer support representatives are the voice of the organization. So the way they talk, act and behave must reflect just that.</p> <p>Even though the specifics depend on the brand’s image, I believe that they must share a number of common traits (<i>e.g. honesty, pro-activity, friendliness, etc</i>)</p> <p>To get a first feeling of how they could be, I asked around about which (<i>fictional or non-fictional</i>) characters people trust the most. The results were quite interesting. Apparently, they would trust <strong><a href='https://en.wikipedia.org/wiki/Samwise_Gamgee' target='_blank'>Sam Gamgee</a></strong>, <strong><a href='https://en.wikipedia.org/wiki/Albus_Dumbledore' target='_blank'>Albus Dumbledore</a></strong> & <strong><a href='https://en.wikipedia.org/wiki/Kim_Possible' target='_blank'>Kim Possible</a></strong>.</p> <p>Using this information, I simulated multiple customer chat discussions, showed it to people, and felt that Albus was the best..!</p> <h2>Conclusion</h2> <p>This project is still at its cradle. Using these results, it is possible to start thinking about the structure of the customer support service, possible tools to use & each communication channel's role. For my part, I have to move on to the next thing. But I learnt a lot about the importance of customer service. Casper, Warby Parker, Zappos & Amazon are really pushing the boundaries in this field. They see customer support more like a marketing investment rather than a cost.</p> <p>Someday, speaking to a customer representative may just become something we will look forward to doing…!</p> </div> ",
	"createdDate"		: "2015-08-20T18:25:43.511Z"
}