{
	"url"				: "diary",
	"type"				: null,
	"title" 			: "Startup Diary",
	"abstract" 			: "Following a startup founder around for a day-and-a-half",
	"logo"				: "assets/logos/diary.svg",
	"photo"				: "assets/photos/diaryintro.jpg",
	"skills"			: [],
	"video"				: null,
	"githubLink"		: null,
	"externalLink"		: null,
	"fileLink" 			: null,
	"blogContent"		: "<div class='container blog'> <h2>Tuesday, 16 September 2015</h2> <p><strong>It’s 11:00</strong>. I’m waiting at the office, in downtown Manhattan. Adam should appear any moment. He’s an entrepreneur bringing a mass consumer product to the market. My phone vibrates. His flight has been delayed. We’re to meet 3 hours later.</p> <p><strong>It’s 14:00</strong>.I arrive at the Marlton Hotel. In a dimly lit dining room, soft jazz is playing and I’m waiting for him to arrive. A member of staff approaches me. She asks me what I’m here for. Awkwardly, I reply that I’m waiting, for a friend. I don’t want to seem unoccupied. I fire-up my phone and browse photos of articles online.</p> <p><strong>It’s 14:30</strong>. Still waiting. A text from Adam says that he’ll be leaving in 20m. I ask were he’s at. I get my response: he’s sitting on the large leather sofa, near the entrance. He’s been there this whole time. On his blue jeans is a golden Macbook Air. He speaks and his voice is broken, hoarse. It’s the voice you get after smoking a pack of cigarets. Or if you’re sick. He’s sick. He’s been ill for the past 2 months. He has a number of discernible tics. He twitches his mouth every so often. He quickly scratches his head. He plays with his fingers when talking.</p> <p>We have 20 minutes to talk before stepping into a meeting.</p> </div> <br/> <p class='text-center'><i>Andy's golden mac</i></p> <div class='jumbotron project-intro full-width-image white' style='background: url(assets/photos/goldenmacair.jpg) no-repeat center center fixed; height: 30em; margin-top:0;'></div> <div class='container blog'> <p>I ask him as many questions as I can. What problem does he think he’s solving? Has he tested the product with users? Has he come to terms with the possibility of failure? Are most startups overvalued today?</p> <p>Although sick, he’s pumped. He’s intense. He’s ecstatic. Sometimes, he replies almost aggressively, dismissively. He jumps from subject to subject. The image of a rooster on steroids pops into my brain. We start walking towards the meeting in Union Square.</p> <p><strong>It’s 15h00</strong>. We’re in a white room of a public relations company. Five people are waiting inside. Two are with Adam. The other three are our hosts. They are in their late thirties / forties. They wear fancy clothes.</p> <p>Money for startups is accessible nowadays. They can get things & services only multinationals could afford.</p> <p>Adam is as ecstatic as always. He explains the product. He explains what’s important to him. They need strong PR near the launch date to make sure that the product get’s known. He twitches his mouth. The discussion jumps from topic to topic: target groups, need for a long-term strategy, scope of the work, budget, timeframe, shaving products (!)… It’s an introductory meeting so everything under the sun get’s covered. It’s a seduction game. People are trying to measure one another.</p> <p>The discussion turns to the story that they need to tell. What’s it all about? What’s the angle? The entrepreneurial journey? The sleek design? The technology? How do you keep the audience’s attention over a long period of time? Adam participates actively but seems hesitant… At the end of the day, they need to sell 5000 units. They need to prove demand, get more money and scale up. The story is simple: a utilitarian, affordable, beautiful product which you can buy right now. Long term planning is important, but for launch, this is the priority.</p> <p>We exit the building. It’s a beautiful day; Adam puts on his glasses. We start walking. I ask him what he's thinking. \"<i>Those people seemed too old. It felt like it was business as usual. We’re trying to create something fresh, new. I don’t understand what they’ll bring to the table</i>\".</p> <p>His phone rings and he jumps on a call. He tells me to meet tomorrow. I start walking down 14th street. The sun is burning. It’s 16h00.</p> </div> <br/> <p class='text-center'><i>@ the Marlton</i></p> <div class='jumbotron project-intro full-width-image white' style='background: url(assets/photos/marltonlobby.jpg) no-repeat center center fixed; height: 30em; margin-top:0;'></div> <div class='container blog'> <h2>Wednesday, 17 September 2015</h2> <p><strong>It’s 09:30</strong>. I’m in the office with Rick. Rick is the head of product. I’m sitting, on a large, white table. We're surrounded by cardboard boxes filled with product samples from China. Artwork hangs on the walls.</p> <p><strong>It’s 10h15</strong>. Adam walks through the door. He opens his mouth and an explosion of topics rushes onto the table. It’s the first wave; another two will shortly follow. Gossip about some marriage, the illness, meeting with some designer, decorating the office, the carlyle group investing in candles, the absurdity of recent startup valuations, Casper’s recent success. In the meantime, Jim, the COO, has walked in. He jumps in the conversation: some investor wants to give $125k. Adam casually agrees. Hours have been condensed to twenty five minutes.</p> <p><strong>It’s 10:40</strong>. Silence falls. Three Apple logos are being reflected on the white table. Adam’s twitching returns. It’s as as if someone has dislocated his jaw & he’s trying to put it back into place. For some strange reason, he's wearing his sunglasses. After 10 minutes, the second wave arrives.</p> <p><strong>It’s 10:50</strong>. Hiring, some investor which owns some competitors’ shares, inside jokes that I don’t get, the industrial designer asking for too much. Suddenly, Adam turns his screen and shows a sort of fashion 'Pinterest' platform which has become hugely successful. It features photos of people with luxury goods. The discussion turns philosophical.</p> <p>\"<i>Who today has this amount of money?</i>\", he asks. \"<i>The previous generation. Young people today are screwed. They don’t have money. If they do, it’s not theirs'; it's their parents'</i>\", he rhetorically replies. <p>\"<i>These people</i>\", he says as he points to the photos on his golden macbook air, \"<i>haven’t created this wealth</i>\".</p> <p>Everyone nods in accordance. The discussion swirls to other topics. Investors & pro-rata are a pain in the ass, their competition will not be ready, coating on the product, the local nature of startups, his father is starting to recognize the importance of his work...</p> <p><strong>It’s 11:30</strong>. Twenty more minutes of silence.</p> <p><strong>It’s 11:50</strong>. The third wave crashes onto the table. HP is laying off people, how to decorate the office, some company which got a huge valuation, whether they should do a press release for raising money. My head is swirling. My stomach is aching. It’s time for lunch.</p> <p><strong> It’s 14:00</strong>. I join in a call with a customer acquisition expert. Adam & Jim are in the conference room. The purpose is to pick his brain on the best way to acquire customers. The connection is poor so I only hear half of what he’s saying. But something feels weird. He keeps repeating how great the product is. Is he sucking up to them?</p> <p>They talk more. Adam & Jim exchange weird looks. Towards the end he starts asking about the financial situation of company. When he’s happy with the numbers, he drops the bomb. I want to work with you. The call wasn’t about helping them, it was about getting money.</p> <p>I’m shocked. How is this possible? They reply: \"<i>As an entrepreneur, you have to be as conscientious as possible. Once you raise money, everyone wants a piece. But its ok. I just keep meeting people & growing my list of contacts. When I need someone, I can easily find the best person for the job</i>\".</p> <p><strong>It’s 15:00</strong>. We move back to the white table outside. The problem with the industrial designer surfaces again. He’s demanding more money and he’s not delivering. Adam becomes very angry. His twitching returns. He plays with his fingers. Enough is enough. They call him. I can’t follow them into the room but I can hear shouting. When they exit, I know that someone got fired.</p> <p>Once you raise money, everyone wants a piece. The problem is, it’s not your money. It’s borrowed money. And in the early stages, you don’t even know if you’re going to make it. Everything is based on thin air; on the gut feeling of a couple of investors.</p> <p><strong>It’s 17:00</strong>. I have a light headache. I place my computer into my bag. We say goodbye. Everybody leaves. We shut the lights and lock the door.</p> </div>",
	"createdDate"		: "2015-09-20T18:25:43.511Z"
}