{
	"url"				: "hackerinresidence",
	"type"				: "placement",
	"title" 			: "Hacker in Residence",
	"abstract" 			: "Doing short tech & design projects at Imperial College London.",
	"logo"				: "assets/logos/hackerinresidencelogo.svg",
	"photo"				: "assets/photos/hackerinresidenceintro.jpg",
	"skills"			: ["coding", "design"],
	"video"				: null,
	"githubLink"		: null,
	"externalLink"		: "http://icah.org.uk/",
	"fileLink" 			: null,
	"createdDate"		: "10 Dec, 2014 23:15:00",
	"blogContent"		: "<div class='container blog'><p>My placement has come to an end :(.</p><p>For 2 months, I was a Hacker in Residence at the <a href='http://icah.org.uk/' target='_blank'>Imperial College Advanced Hackerspace</a>. My mission was two-fold: do weekly tech & design projects and help any hackerspace members with their prototyping.</p><p>Overall, it was a very good experience. I learnt a lot! The projects I did centered mostly around electronics & physical object design. And it was by doing the latter that really learnt a lot of new stuff.</p><p>For some reason, I believed that creating physical objects was not that difficult. Designing a tape dispenser, a pen or a gear mechanism seemed easy. But when I sat down to do it, I realized that I couldn't be more wrong. What seems natural & simple is the product of a process involving endless sketching, iterations, discussions & choices.</p><h2>Physical Object Design V0.0</h2><p>During one of my weekly projects I tried to design a relatively complex mechanical part: <a href='#project/cadand3dprinting' target='_blank'>a spherical 4-bar linkage mechanism</a>. In the process, I learnt how to use CAD software (Solidworks), operate a 3D printer and make geometric calculations so that all the parts fit well together. I didn't get it to work the first time. The second time over, it didn't work either. The 3rd print was a failure. By the 4th iteration it was working, but only just.</p></div><div class='jumbotron full-width-image full-height-image' style=\"background-image:url('assets/photos/4barlinkagemechanism.jpg')\"></div><div class='container blog'><p>There are so many parameters that you need to consider. So many things that can go wrong. The printer may fail mid-way. The tolerances may not be what you thought them to be. The colors may be different to what you expected. A single, badly designed part may screw up the entire construction. The only way to make it work is by making it, over & over again, iteration after iteration, until it works. Patience and experience. Those are the key ingredients.</p><h2>Physical Object Design V0.1</h2><p>After creating an object whose form was dictated mostly by mathematical formulae, it was time to do something more \"creative\".</p><p>I was given as a mission to create a \"Kinder Tape Dispenser\". The question was: \"if Kinder were to create a tape dispenser, how would it look like\"? I researched the brand, identified a target audience and came up with an innovative concept: a flexible chocolate, rolled up in a tape-dispenser shaped as a fish.</p></div><div class='jumbotron full-width-image full-height-image' style=\"background-image:url('assets/photos/kindertapedisplenser.jpg')\"></div><div class='container blog'><p>Turning a small wheel would dispense the delicious, double coated chocolate into the glutinous child's mouth. I learnt a lot of things by doing this project. But the most important realisation was the importance of sketching.</p><h2>Don't be afraid: Sketch!</h2><p>Sketching is key to accelerate the conception phase and reduce errors. There are a million different ways of creating an object. An endless array of possibilities relating to the overall shape, the manufacturing process and even the curvature of its corners.</p><p>Sketching provides a fast way to explore these possibilities. You start off with a sketch and then you \"see\" or \"feel\" what's good and what's bad. You do another sketch trying to reinforce the good parts and explore other possibilities. And you sketch again and again and again. You show it to someone to get their feedback. And you go back again to your sketching board. Only when you are happy with the result do you move to CAD modelling.</p></div><div class='jumbotron full-width-image full-height-image' style=\"background-image:url('assets/photos/25sketches.jpg')\"></div><div class='container blog'><p>I found it tough. I had never really sketched. I felt that my hand was numb, it couldn't draw what my mind wanted it to. Going directly to CAD was technically easier but it was very restrictive. CAD didn't allow my mind to roam free. The results were banal, not well-thought and error-prone. Aside from sketching for the \"Kinder Tape Dispenser\" project, I started sketching everyday objects, to improve my technique. I completed <a href='#project/25sketches' target='_blank'>25 sketches</a> in a week and I aim to do 225 by the end of my Univership.</p><p>Sketching can also be an incredibly important communication tool. I often find myself trying to explain a concept or an idea to someone. Words are usually not enough. So I pick up a pen and I try to illustrate it via a sketch. Needless to say, this usually makes matters worst...! But were my appalling drawing skills to improve, I think misunderstandings could be avoided.</p><h2>Any drawbacks?</h2><p>All in all, it was a very satisfying experience. That is not to say that it didn't have its drawbacks. One of my main criticisms was that the projects were individual. I was usually alone. I would have liked to have worked more closely with another person, within a team. This would have helped me explore fresh ideas & boost my morale when I was feeling low.</p><p>Another problem I encountered was that I sometimes did projects in which I didn't learn something new. This happened mostly when I was playing around with electronics. I think the fault lies mostly with me on this one. I chose to do stuff that I more or less knew, probably because of laziness coupled with the fact that there was a real need in the Hackerspace.</p><p>Finally, I would have liked to have helped more Hackerspace members with their projects & prototyping (I only got to help two). The reason is that ICAH is a relatively new organisation and is trying to increase its members count. Give it a couple of months and the place will be swarming with people asking for help...!</p><h2>Special Thanks</h2><p>Key to me learning a lot about physical object design was being mentored by two excellent designers/engineers: <a href='https://uk.linkedin.com/pub/larissa-kunstel-tabet/3a/41/a37' target='_blank'>Larissa Kunstel-Tabet</a> & <a href='http://uk.linkedin.com/pub/chris-pinches/3b/23/66' target='_blank'>Chris Pinches</a>.</p><p>It was also great working with Miles Taylor-Robinson & <a href='http://www.imdb.com/name/nm3890373/' target='_blank'>Eifion Melnyk</a> on the PR of the Hackerspace.</p><p>And finally, I loved discussing with <a href='https://www.facebook.com/aksat.shah?fref=ts' target='_blank'>Aksat Shah</a> & <a href='https://uk.linkedin.com/in/jingshengpang' target='_blank'>Jing Sheng Pang</a> about the Internet of Things, Wearable Electronics & Home Automation!</p></div>"
}