{
	"url"				: "hardwarestartup",
	"type"				: "placement",
	"title" 			: "Hardware Startup",
	"abstract" 			: "Discovering how an early-stage, high-growth tech company works.",
	"logo"				: "assets/logos/hardwarestartuplogo.svg",
	"photo"				: "assets/photos/hardwarestartupintro.jpg",
	"skills"			: ["business"],
	"video"				: null,
	"githubLink"		: null,
	"externalLink"		: null,
	"fileLink" 			: null,
	"createdDate"		: "2015-07-21T18:25:43.511Z",
	"blogContent"		: "<div class='container blog'> <i><p>We’ve all seen <a href='https://www.youtube.com/watch?v=lB95KLmpLR4' target='_blank'>the movies</a>, <a href='https://www.youtube.com/watch?v=69V__a49xtw' target='_blank'>the series</a>, <a href='http://techcrunch.com/' target='_blank'>the news articles</a>. Modern culture is infatuated with them. Startups. But what are they really like? I spent 3 months inside a high growth one in New York to find out.</p></i> <h1>THE STARTUP</h1> <p><i>Note: I cannot mention the company’s name so I’ll use 'S' as a shorthand.</i></p> <p> <ul> <li>S is developing a connected hardware product for the travel industry</li> <li>S will launch it in winter</li> <li>S recently raised a seed round of a couple of million dollars</li> <li>S employees 10 people: six in NY and four in Hong Kong.</li> <li>S has a large number of external consultants (<i>from dev shops to branding agencies</i>)</li> </ul> <p>When I arrived, there were only 3 people in the company. I saw it grow to its current size in just under 3 months!</p> </p> <h1>THE PROCESS</h1> <p>I did bi-weekly projects with everyone in the company. This included:</p> <ul> <li>The Founder</li> <li>The Chief of Product</li> <li>The CTO</li> <li>Logistics & Operations</li> </ul> <p>This allowed me to observe how people thought, why they were chosen for the role and how they interacted with others.</p> <p>These were the projects I was involved with:</p> <ul> <li><a href='#project/diary' target='_blank'>Chasing the founder around for a couple of days</a></li> <li><a href='#project/ecommerceandagile' target='_blank'>Choosing features for the eCommerce platform</a></li> <li><a href='#project/offlineandonline' target='_blank'>Exploring Brick & Mortar store options</a></li> <li><a href='#project/customersupport' target='_blank'>Creating the foundations for a customer service</a></li> <li>Performing a technology benchmark of geolocation technologies</li> </ul> <p>I spent as much time as possible in the office. I also squeezed into any meeting that I possibly could.</p> <h1>LESSONS LEARNT</h1> <div class='panel-group' id='accordion' role='tablist' aria-multiselectable='true'> <div class='panel panel-default'> <div class='panel-heading' role='tab' id='headingOne'> <h2 class='panel-title'> <a role='button' data-toggle='collapse' data-parent='#accordion' href='#collapseOne' aria-expanded='true' aria-controls='collapseOne'> 1. Our generation will try to re-invent everything </a> </h2> </div> <div id='collapseOne' class='panel-collapse collapse' role='tabpanel' aria-labelledby='headingOne'> <img class='panel-image' src='assets/photos/ourgenerationwilltrytoreinventeverything.gif' width='100%' /> <div class='panel-body'> Our generation has no money. Many are already in debt. But we grew up with an unprecedented level of comfort. This can only mean one thing. We seek quality products with very low cost; we need luxury goods at democratic prices. <p>This implies that anything can change. Anything. From food to education & from glasses to suitcases. Everything we have around us was created by & for our parents. But we are different. We are both more demanding & have very little money.</p> <p>The root cause of change is a dramatic shift in consumer behavior. Technology is simply a tool. It allows us to bring prices down whilst maintaining or improving the quality.</p> <p>This idea is truly liberating. Instead of focusing on making the next big technological “thing” (see 3D printing or drones) let’s focus on re-inventing things we take for granted. The things we believe cannot change. Like fast food chains or real estate. Their age is a hindrance rather than a blessing.</p> <p>Let’s try to create luxury goods at democratic prices.</p> </div> </div> </div> <div class='panel panel-default'> <div class='panel-heading' role='tab' id='headingTwo'> <h2 class='panel-title'> <a class='collapsed' role='button' data-toggle='collapse' data-parent='#accordion' href='#collapseTwo' aria-expanded='false' aria-controls='collapseTwo'> 2. Startups are brutal & cynical </a> </h2> </div> <div id='collapseTwo' class='panel-collapse collapse' role='tabpanel' aria-labelledby='headingTwo'> <img class='panel-image' src='assets/photos/startupsarebrutal.gif' width='100%' /> <div class='panel-body'> When you have no money, very few people want to help you. They are usually genuinely interested in your idea. But you cannot attract the best talent due to your limited financial resources. <p>When you raise money however, everything changes. You start bleeding in the shark tank.</p> <p>After raising a few million dollars during his seed round, I saw Adam, the founder, battling on three fronts. His consultants increased their billable hours and worked less time. Employees wanted a greater salary and more equity. Random people requested to meet with him, trying to get a consulting gig or get hired.</p> <p>At all times Adam had to decide whether a particular person would bring more to the table than he would take. His approach to labour was almost cynical. Adam thought of people as opportunists, each advancing his/her self-interests. As long the relationship was mutually beneficial, everything was ok. “Everyone can be replaced” I heard him repeat a couple of times. He was a true capitalist, a genuine Adam Smith follower.</p> <p>Adopting this world view simplified things greatly. As long as he could “measure” the amount by which he was benefitting, he could judge whether or not to terminate the relationship. And no hard feelings were kept, it’s wasn't personal - it was business.</p> <p>You may or may not agree with Adam's work ethic. But this is not the point I’m trying to make. I found it interesting to witness it in action. It acts as a mechanism to simplify work relationships. It tries to take the emotion out of the equation and make everything rational. Minimal emotion - rationalization - no guilt.</p> <p>For those of you hoping to find in startups a totally different work ethic, I say you think twice. They are as capitalist as it gets. Financially successful startups are not re-inventing the moral compass. No matter how many ping pong tables they may have.</p> </div> </div> </div> <div class='panel panel-default'> <div class='panel-heading' role='tab' id='headingThree'> <h2 class='panel-title'> <a class='collapsed' role='button' data-toggle='collapse' data-parent='#accordion' href='#collapseThree' aria-expanded='false' aria-controls='collapseThree'> 3. Go against the VC frenzy </a> </h2> </div> <div id='collapseThree' class='panel-collapse collapse' role='tabpanel' aria-labelledby='headingThree'> <img class='panel-image' src='assets/photos/goagainstthevcfrenzy.gif' width='100%' /> <div class='panel-body'> When do people consider a startup successful? Nowadays, it seems that raising a bunch of money suffices. <p>But raising money does not constitute success; success is all about having customers & a positive balance. Raising capital simply means that the gut feeling of some rich people made them give you money.</p> <p>Adam managed to grab the attention of a couple of big-shot investors. Then the frenzy started. People rushed to give him money. Consultants raised their tariffs. Firms wanted to work with him. A crazy hype. But it didn’t go to his head.</p> <p>Adam, contrary to all these people, understood that venture capital money didn’t imply success. He remained frugal. He didn’t rent an office space. People who asked for too much were laid off. He kept repeating that they needed to sell; otherwise, it was over.</p> <p>It seems as common sense, no? You’d be surprised at how many people think & do otherwise. Their egos are fed by the media frenzy, by people telling them how great they are. They become convinced that they’ve made it. They start pouring money on office spaces, on furniture, on expensive branding firms. Meanwhile, they remain unprofitable.</p> <p>Today the startup community thinks that raising money guarantees success, probably because it shows big numbers in little time. It follows this trend of aspiring to make something incredibly successful very fast (e.g <a href='https://www.backblaze.com/blog/dont-build-a-billion-dollar-business-really/?utm_content=bufferd7ce3&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer' target='_blank'>this absurd obsession with unicorns</a>). Making a modest profit is of a secondary consideration.</p> <p>Unfortunately, hubris is usually followed by swift demise.</p> </div> </div> </div> <div class='panel panel-default'> <div class='panel-heading' role='tab' id='headingFour'> <h2 class='panel-title'> <a class='collapsed' role='button' data-toggle='collapse' data-parent='#accordion' href='#collapseFour' aria-expanded='false' aria-controls='collapseFour'> 4. Create a Hero Product, not an Ecosystem </a> </h2> </div> <div id='collapseFour' class='panel-collapse collapse' role='tabpanel' aria-labelledby='headingFour'> <img class='panel-image' src='assets/photos/createaheroproduct.gif' width='100%' /> <div class='panel-body'> Let’s compare Beats by Dre & Apple. The former created an headphone brand. People loved the product. That’s the reason they bought it and that’s how Beats essentially made money. Plain & simple. <p>Apple on the other hand tries to create a music ecosystem: through iTunes, the iPod, the recent acquisition of Beats and the launch of Apple Music. Apple’s end goal is not the hardware product itself; Apple is using its hardware to leverage its software.</p> <p>And this brings us to an interesting point on hardware products. It’s main advocate is <a href='https://www.bolt.io/' target='_blank'>Bolt</a>, a seed stage fund for hardware startups. Their thesis is that the physical product is there to lure people in. But the real value lies elsewhere, in the software. To use a Greek war metaphor, the physical product is a trojan horse and therein lies the true \"threat\"; the software.</p> <p>Bolt often uses the following two examples to prove their point:</p> <ul> <li><strong><a href='https://kinsahealth.com/' target='_blank'>Kinsa</a>:</strong> it's not really about a thermometer. The thermometer is a way to sell telemedicine to users, through their mobile application.</li> <li><strong><a href='http://www.petnet.io/' target='_blank'>Petnet</a>:</strong> It's not about the feeding device. It's about the distribution of pet food.</li> </ul> <p>An interesting idea, no?</p> <p>Before parting ways, I asked Adam whether he wanted to create an ecosystem or a hero product. He replied that in the short term future he just wanted to make a great product. After that, he didn’t really know.</p> <p>I think I understand why. If you don’t have a great a product, people won't buy it. Any plans you’ve made for the future will go down the drain. Given the limited amount of resources and the complexity of hardware products, it’s best to focus your energy on creating an amazing product, a hero product. Then, you can leverage its success to create an ecosystem.</p> </div> </div> </div> <div class='panel panel-default'> <div class='panel-heading' role='tab' id='headingFive'> <h2 class='panel-title'> <a class='collapsed' role='button' data-toggle='collapse' data-parent='#accordion' href='#collapseFive' aria-expanded='false' aria-controls='collapseFive'> 5. Startups are local, not global. </a> </h2> </div> <div id='collapseFive' class='panel-collapse collapse' role='tabpanel' aria-labelledby='headingFive'> <img class='panel-image' src='assets/photos/startupsarelocal.gif' width='100%' /> <div class='panel-body'> Why are startups concentrated in a few major cities (<i>San Fransisco, New York, Boston, etc…</i>)? I imagined that their pursuit of global expansion and the extent of their technology use would allow them to be based anywhere. I couldn’t be more wrong. <p>I discovered that success is largely based on who you know. This defines your investors, your consultants, your employees & your partners. And networking is almost impossible if you don’t physically meet the other person.</p> <p>Major cities provide a dense concentration of these populations. It’s an oxymoron: startups' rapid global expansion is contrasted by their truly local nature.</p> </div> </div> </div> <div class='panel panel-default'> <div class='panel-heading' role='tab' id='headingSix'> <h2 class='panel-title'> <a class='collapsed' role='button' data-toggle='collapse' data-parent='#accordion' href='#collapseSix' aria-expanded='false' aria-controls='collapseSix'> 6. Startup teams are not made of tinkerers </a> </h2> </div> <div id='collapseSix' class='panel-collapse collapse' role='tabpanel' aria-labelledby='headingSix'> <img class='panel-image' src='assets/photos/startupteamsarenottinkerers.gif' width='100%' /> <div class='panel-body'> I often heard of people tinkering in their garage, doing their thing, and magically creating a billion-dollar company. This is not what I experienced. In fact, what I saw was very different. <p>Adam, the Founder, is not a tinkerer. His core team was not made of tinkerers. They were professionals; whether it be in logistics & operations, product management or IT. They didn’t do the actual work themselves. Adam’s core team managed people who did that. They worked with industrial designers, branding agencies, dev shops, electronic engineers, manufacturing facilities, shipping agents… They oversaw and coordinated efforts in two continents. To me, Adam’s core team seemed more like executives than tinkerers.</p> <p>And it makes sense. When launching a complicated product on a global scale there are a million things you need to do. It is impossible to do it all by yourself. Even 10 people can’t do it. Adam probably has 50-100 people working on it, one way or another. To pull it through, he needs to be surrounded by people who can coordinate these efforts. \"<i>I need leaders</i>\", he told me. \"<i>I need people who will disturb me only when it’s absolutely necessary</i>\".</p> </div> </div> </div> <div class='panel panel-default'> <div class='panel-heading' role='tab' id='headingSeven'> <h2 class='panel-title'> <a class='collapsed' role='button' data-toggle='collapse' data-parent='#accordion' href='#collapseSeven' aria-expanded='false' aria-controls='collapseSeven'> 7. Should you go for it? </a> </h2> </div> <div id='collapseSeven' class='panel-collapse collapse' role='tabpanel' aria-labelledby='headingSeven'> <img class='panel-image' src='assets/photos/shouldyougoforit.gif' width='100%' /> <div class='panel-body'> On my last day, I asked Adam what made him create his company. We were sitting on the steps of the stock market, next to George Washington’s statue. We both had a Neapolitan pizza in our hands. He replied that he had failed in everything else that he had done. He had started off as a lawyer & then became an executive at a large apparel firm. I asked him why he said this. \"<i>I always focused on the big picture. My superiors gave me small tasks, details. I couldn’t do it, I was bad at it</i>\", he replied. <p>I asked whether he regretted not starting the company earlier. He hesitated. He changed subjects. I never got a response. I personally believe that it would have been impossible. So much of what he wants to create is a reaction to his past experiences. He is obsessed with this idea of the world not responding to the needs & capabilities of the new generation. In a way, he is projecting his own life onto the brand he wants to create.</p> <p>Before parting ways, I asked him whether he was afraid of failure. \"<i>If it fails, I don’t know what I’ll do. I’ll probably have to work at a large firm to earn a living. I don’t want to do that</i>\".</p> </div> </div> </div> </div> </div>"
}