{
	"url"				: "offlineandonline",
	"type"				: null,
	"title" 			: "Offline & Online",
	"abstract" 			: "Our e-commerce business needs a physical presence to engage with customers.",
	"logo"				: "assets/logos/offlineandonline.svg",
	"photo"				: "assets/photos/offlineandonlineintro.jpg",
	"skills"			: ["design", "business"],
	"video"				: null,
	"githubLink"		: null,
	"externalLink"		: null,
	"fileLink" 			: null,
	"blogContent"		: "<div class='container blog'> <p><i>Our e-commerce business needs a physical presence to engage with customers. What should it be?</i></p> <p>This was the question I was asked. Equipped with minimal knowledge about the industry and the brand, I ventured to explore the possibilities.</p> <p>This is a hot topic. Whether it be eBay, Warby Parker, or Kate Spade, they're all trying to fuse the digital & the virtual. <a href='#project/hardwarestartup'>The company I’m doing my placement at</a>, is asking the same question.</p> <p>Over the course of 2 weeks I:</p> <ul> <li>researched the industry</li> <li>visited existing retail installations & stores</li> <li>shadowed & interviewed retail salespeople</li> <li>observed customers & users</li> </ul> <h2>WHAT TYPE OF PHYSICAL PRESENCE?</h2> <p>Any physical object or installation which interacts with the customer before he/she decides to purchace the product.</p> <p>This definition spans a simple advertisement billboard, a street performance or a full-fledged store.</p> </div> <br/> <img src='assets/photos/katespadestore.jpg' width='100%'/> <br/> <div class='container blog'> <h2>ISN’T INTERNET SHOPPING ENOUGH?</h2> <p>Sure. But it’s not all about shopping. For e-commerse businesses, I think it boils down to this:</p> <ul> <li><strong>\"I want people to discover my brand\"</strong></li> <li><strong>\"I want to strengthen the bond people have with my brand\"</strong></li> </ul> <p>Having a physical presence can surely help. For 3 reasons:</p> <ol> <li>Human Contact</li> <li>Stronger impressions & experiences</li> <li>Testing / Touching the actual products</li> </ol> <h2>MY CONCLUSIONS</h2> <p>I figured there were 4 distinct possibilities. The major questions were whether the customer needed to test the product and if he/she needed to purchase it immediately after the interaction.</p> <p>As a function of the team’s remarks, I then focused on two possibilities and drew up the 'rules' that should guide their implementation.</p> </div> <br/> <img src='assets/photos/offlineandonlinematrix.jpg' width='100%'/> <div class='container blog'> <div class='col-xs-12'> <strong>Examples:</strong> </div> <div class='col-xs-6'> <ul> <li><a href='https://www.youtube.com/watch?v=M0D3jKLz6sA' target='_blank'>TEST THE PRODUCT </a></li> <li><a href='https://vimeo.com/60156741' target='_blank'>SEE THE PRODUCT/BRAND</a></li> </ul> </div> <div class='col-xs-6'> <ul> <li><a href='https://www.youtube.com/watch?v=IBMR3FUNsD4' target='_blank'>TEST THE PRODUCT & BUY IT</a></li> <li><a href='https://www.youtube.com/watch?v=5fMMm5PNeDw' target='_blank'>SEE THE PRODUCT & BUY IT</a></li> </ul> </div> <h2>WHAT I LEARNT</h2> <p>This project was a great introduction to the company, the industry and the users. By giving me very little info, I had to start from scratch, with no pre-conceptions; from who the user is & what he/she wants. I can now start to understand how the company is trying to reply to these needs.</p> <p>It’s crazy how much you can learn just by observing people. A couple of hours in a retail store suffice to discover a number of problems people are having. Sure, salespeople think you’re weird when you tell them that you just want to sit in a corner & look. But you gain invaluable insights. You see things that you couldn’t have imagined.</p> <p>But it’s a double-edged sword. Starting with a tabula rasa introduces a lot of uncertainty. I was probably reinventing the wheel (<i>Josh, the founder, has probably spent months reaching similar conclusions</i>). It’s very difficult to start with a brief so wide and almost no info on branding.</p> <p>But it’s probably the best way to start learning.</p> </div> <br/> <img src='assets/photos/retailstore.jpg' width='100%'/>",
	"createdDate"		: "2015-08-12T18:25:43.511Z"
}